In [ ]:
# Practical-3: Advanced Pandas Concepts
# This notebook shows how to use Pandas and NumPy for advanced data operations.

# Importing the libraries
import pandas as pd  # For data manipulation
import numpy as np   # For numerical operations

## 1. Concatenation and Appending Data

We will create three small DataFrames representing quarterly sales and demonstrate concatenation both vertically and horizontally.

In [ ]:
# 1. Concatenation and Appending Data
# Let's create three small DataFrames for quarterly sales
q1 = pd.DataFrame({
    'Product': ['A', 'B', 'C'],
    'Units_Sold': [100, 150, 200],
    'Quarter': ['Q1']*3
})
q2 = pd.DataFrame({
    'Product': ['A', 'B', 'C'],
    'Units_Sold': [120, 130, 210],
    'Quarter': ['Q2']*3
})
q3 = pd.DataFrame({
    'Product': ['A', 'B', 'C'],
    'Units_Sold': [140, 160, 220],
    'Quarter': ['Q3']*3
})
# Show the DataFrames
q1, q2, q3

(  Product  Units_Sold Quarter
 0       A         100      Q1
 1       B         150      Q1
 2       C         200      Q1,
   Product  Units_Sold Quarter
 0       A         120      Q2
 1       B         130      Q2
 2       C         210      Q2,
   Product  Units_Sold Quarter
 0       A         140      Q3
 1       B         160      Q3
 2       C         220      Q3)

In [ ]:
# Concatenate vertically (add rows)
# This combines all quarters into one DataFrame
annual_sales = pd.concat([q1, q2, q3], ignore_index=True)
annual_sales

  Product  Units_Sold Quarter
0       A         100      Q1
1       B         150      Q1
2       C         200      Q1
3       A         120      Q2
4       B         130      Q2
5       C         210      Q2
6       A         140      Q3
7       B         160      Q3
8       C         220      Q3

In [ ]:
# Concatenate horizontally (add columns)
# This puts the DataFrames side by side
concat_horizontal = pd.concat([q1, q2, q3], axis=1)
concat_horizontal

,Product,Units_Sold,Quarter,Product,Units_Sold,Quarter,Product,Units_Sold,Quarter
0,A,100,Q1,A,120,Q2,A,140,Q3
1,B,150,Q1,B,130,Q2,B,160,Q3
2,C,200,Q1,C,210,Q2,C,220,Q3

## 2. Merging and Joining Data

We will create a product price list and demonstrate different types of joins and NumPy-based calculations.

In [6]:
# Product price list
table_prices = pd.DataFrame({
    'Product': ['A', 'B', 'C'],
    'Price': [10, 20, 15]
})
table_prices

  Product  Price
0       A     10
1       B     20
2       C     15

In [7]:
# Merge annual_sales with table_prices (inner join)
merged_inner = pd.merge(annual_sales, table_prices, on='Product', how='inner')
merged_inner

  Product  Units_Sold Quarter  Price
0       A         100      Q1     10
1       B         150      Q1     20
2       C         200      Q1     15
3       A         120      Q2     10
4       B         130      Q2     20
5       C         210      Q2     15
6       A         140      Q3     10
7       B         160      Q3     20
8       C         220      Q3     15

In [8]:
# Merge annual_sales with table_prices (left join)
merged_left = pd.merge(annual_sales, table_prices, on='Product', how='left')
merged_left

  Product  Units_Sold Quarter  Price
0       A         100      Q1     10
1       B         150      Q1     20
2       C         200      Q1     15
3       A         120      Q2     10
4       B         130      Q2     20
5       C         210      Q2     15
6       A         140      Q3     10
7       B         160      Q3     20
8       C         220      Q3     15

In [9]:
# Merge annual_sales with table_prices (right join)
merged_right = pd.merge(annual_sales, table_prices, on='Product', how='right')
merged_right

  Product  Units_Sold Quarter  Price
0       A         100      Q1     10
1       A         120      Q2     10
2       A         140      Q3     10
3       B         150      Q1     20
4       B         130      Q2     20
5       B         160      Q3     20
6       C         200      Q1     15
7       C         210      Q2     15
8       C         220      Q3     15

In [10]:
# Merge annual_sales with table_prices (outer join)
merged_outer = pd.merge(annual_sales, table_prices, on='Product', how='outer')
merged_outer

  Product  Units_Sold Quarter  Price
0       A         100      Q1     10
1       A         120      Q2     10
2       A         140      Q3     10
3       B         150      Q1     20
4       B         130      Q2     20
5       B         160      Q3     20
6       C         200      Q1     15
7       C         210      Q2     15
8       C         220      Q3     15

In [11]:
# Merge using index vs. column
# Set index for annual_sales and merge with table_prices using left_index/right_on
annual_sales_indexed = annual_sales.set_index('Product')
merged_index = pd.merge(annual_sales_indexed, table_prices, left_index=True, right_on='Product')
merged_index

   Units_Sold Quarter Product  Price
0         100      Q1       A     10
1         150      Q1       B     20
2         200      Q1       C     15
0         120      Q2       A     10
1         130      Q2       B     20
2         210      Q2       C     15
0         140      Q3       A     10
1         160      Q3       B     20
2         220      Q3       C     15

In [12]:
# Compute total revenue using NumPy vectorized multiplication
merged_inner['Revenue'] = np.multiply(merged_inner['Units_Sold'], merged_inner['Price'])
merged_inner

  Product  Units_Sold Quarter  Price  Revenue
0       A         100      Q1     10     1000
1       B         150      Q1     20     3000
2       C         200      Q1     15     3000
3       A         120      Q2     10     1200
4       B         130      Q2     20     2600
5       C         210      Q2     15     3150
6       A         140      Q3     10     1400
7       B         160      Q3     20     3200
8       C         220      Q3     15     3300

## 3. Pivot, Pivot Table, and Melt

We will demonstrate reshaping data using pivot, pivot_table, and melt.

In [13]:
# Pivot: Products as columns, Quarters as rows, Units_Sold as values
pivoted = annual_sales.pivot(index='Quarter', columns='Product', values='Units_Sold')
pivoted

Product    A    B    C
Quarter
Q1       100  150  200
Q2       120  130  210
Q3       140  160  220

In [14]:
# Pivot table: Total units sold per product per quarter
pivot_table = pd.pivot_table(annual_sales, values='Units_Sold', index='Quarter', columns='Product', aggfunc='sum', fill_value=0)
pivot_table

Product    A    B    C
Quarter
Q1       100  150  200
Q2       120  130  210
Q3       140  160  220

In [15]:
# Melt: Convert wide-format marks to long-format
marks = pd.DataFrame({
    'Student': ['Alice', 'Bob'],
    'Math': [85, 90],
    'Science': [92, 88],
    'English': [78, 85]
})
marks_long = pd.melt(marks, id_vars=['Student'], value_vars=['Math', 'Science', 'English'], var_name='Subject', value_name='Marks')
marks_long

  Student  Subject  Marks
0   Alice     Math     85
1     Bob     Math     90
2   Alice  Science     92
3     Bob  Science     88
4   Alice  English     78
5     Bob  English     85

## 4. Stack, Unstack, and Crosstab

We will demonstrate stack, unstack, and crosstab operations, and use NumPy for normalization.

In [16]:
# Create a MultiIndex DataFrame
multi = annual_sales.set_index(['Quarter', 'Product'])
multi

                 Units_Sold
Quarter Product
Q1      A               100
        B               150
        C               200
Q2      A               120
        B               130
        C               210
Q3      A               140
        B               160
        C               220

In [17]:
# Stack: Move columns to row index
stacked = multi.stack()
stacked

Quarter  Product
Q1       A        Units_Sold    100
         B        Units_Sold    150
         C        Units_Sold    200
Q2       A        Units_Sold    120
         B        Units_Sold    130
         C        Units_Sold    210
Q3       A        Units_Sold    140
         B        Units_Sold    160
         C        Units_Sold    220
dtype: int64

In [18]:
# Unstack: Move row index back to columns
unstacked = stacked.unstack()
unstacked

                 Units_Sold
Quarter Product
Q1      A               100
        B               150
        C               200
Q2      A               120
        B               130
        C               210
Q3      A               140
        B               160
        C               220

In [19]:
# Crosstab: Frequency of products sold per quarter
crosstab = pd.crosstab(annual_sales['Quarter'], annual_sales['Product'])
crosstab

Product  A  B  C
Quarter
Q1       1  1  1
Q2       1  1  1
Q3       1  1  1

In [20]:
# Normalize crosstab to get percentage distribution
crosstab_percent = crosstab.div(crosstab.sum(axis=1), axis=0) * 100
crosstab_percent

Product          A          B          C
Quarter
Q1       33.333333  33.333333  33.333333
Q2       33.333333  33.333333  33.333333
Q3       33.333333  33.333333  33.333333

## 5. Reflection

Pandas is more convenient than pure NumPy for tabular data due to its labeled axes, flexible reshaping, and built-in relational operations (merge, join, pivot). NumPy is still useful for fast vectorized computations inside Pandas workflows, such as calculating new columns or normalizing data.